app/views/groups/_form.html.erb

SELECT "locations".* FROM "locations"
---
    <%= f.label :location_ids %><br />
    <%= f.collection_select :location_ids, Location.all, :id, :name, {}, { :multiple => true, :selected => 'group[location_ids]', :name => 'group[location_ids][]' } %>

SELECT "users".* FROM "users"
---
    <%= f.label :user_ids %><br />
    <%= f.collection_select :user_ids, User.all, :id, :name, {}, { :multiple => true, :selected => 'group[user_ids]', :name => 'group[user_ids][]' } %>