app/views/users/_form.html.erb

    <%= f.label :group_ids %><br />
    <%= f.collection_select :group_ids, Group.all, :id, :name, {}, { :multiple => true, :selected => 'user[group_ids]', :name => 'user[group_ids][]' } %>
---
SELECT "groups".* FROM "groups"
SELECT 1 FROM "users" WHERE ("users"."name" = 'Red Loser') LIMIT 1

    <%= f.label :locationset_ids %><br />
    <%= f.collection_select :locationset_ids, Locationset.all, :id, :name, {}, { :multiple => true, :selected => 'user[locationset_ids]', :name => 'user[locationset_ids][]' } %>
---
SELECT "locationsets".* FROM "locationsets"