app/controllers/audiofiles_controller.rb

SELECT "audiofiles".* FROM "audiofiles"
---
  def index
    @audiofiles = Audiofile.all

SELECT "audiofiles".* FROM "audiofiles" WHERE "audiofiles"."id" = 1 LIMIT 1
---
  def show
    @audiofile = Audiofile.find(params[:id])

INSERT INTO "audiofiles" ("name", "url", "created_at", "updated_at") VALUES ('foo', 'bar.blah', '2011-07-01 17:26:53.960923', '2011-07-01 17:26:53.960923')
---
  def create
    @audiofile = Audiofile.new(params[:audiofile])

    respond_to do |format|
      if @audiofile.save