app/controllers/groups_controller.rb

  def create
    @group = Group.new(params[:group])

################## We need to do something here about the new locations?
    #@group.locations =
    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "synth_id", "audio_id", "synth_instance_id", "created_at", "updated_at") VALUES ('Gold Team', 1, 1, 1, '2011-07-01 15:12:28.060564', '2011-07-01 15:12:28.060564')

  def update
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1