app/controllers/groups_locations_controller.rb

  def index
    @groups_locations = GroupsLocation.all
---
SELECT "groups_locations".* FROM "groups_locations"

  def create
    @groups_location = GroupsLocation.new(params[:groups_location])

    respond_to do |format|
      if @groups_location.save
---
INSERT INTO "groups_locations" ("group_id", "location_id", "created_at", "updated_at") VALUES (1, 1, '2011-07-01 17:28:09.414174', '2011-07-01 17:28:09.414174')