app/controllers/locations_users_controller.rb

SELECT "locations_users".* FROM "locations_users"
---
  def index
    @locations_users = LocationsUser.all

INSERT INTO "locations_users" ("created_at", "updated_at", "location_id", "user_id") VALUES ('2011-07-14 23:33:40.774581', '2011-07-14 23:33:40.774581', NULL, NULL)
---
  def create
    @locations_user = LocationsUser.new(params[:locations_user])

    respond_to do |format|
      if @locations_user.save