app/controllers/locations_controller.rb

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "created_at", "updated_at", "param_1", "param_2", "param_3", "synth", "latitude", "longitude") VALUES ('Union', '2011-07-17 22:46:11.474388', '2011-07-17 22:46:11.474388', NULL, NULL, NULL, NULL, 30.412812, -91.177114)

  def device_create
    @location = Location.new(params[:location])
    data = {"name" => params[:name], "latitude" => params[:latitude], "longitude" => params[:longitude], "synth" => params[:synth], "param_1" => 0.0, "param_2" => 0.0, "param_3" => 0.0}
    @location.update_attributes(data)
    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "created_at", "updated_at", "param_1", "param_2", "param_3", "synth", "latitude", "longitude") VALUES ('459', '2011-07-25 20:59:24.418019', '2011-07-25 20:59:24.418019', NULL, NULL, NULL, NULL, 30.410467999999998, -91.174238)

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 2 LIMIT 1
UPDATE "locations" SET "latitude" = 30.41258538, "longitude" = -91.1725591, "updated_at" = '2011-07-17 22:43:40.093324' WHERE "locations"."id" = 3