app/controllers/locationsets_controller.rb

SELECT "locationsets".* FROM "locationsets"
---
  def index
    @locationsets = Locationset.all

SELECT "locationsets".* FROM "locationsets" WHERE "locationsets"."id" = 1 LIMIT 1
---
  def show
    @locationset = Locationset.find(params[:id])

SELECT "locationsets".* FROM "locationsets" WHERE "locationsets"."id" = 1 LIMIT 1
---
  def edit
    @locationset = Locationset.find(params[:id])

INSERT INTO "locationsets" ("name", "created_at", "updated_at") VALUES ('Playlist 1', '2011-07-05 20:43:25.896200', '2011-07-05 20:43:25.896200')
---
  def create
    @locationset = Locationset.new(params[:locationset])

    respond_to do |format|
      if @locationset.save

SELECT "locationsets".* FROM "locationsets" WHERE "locationsets"."id" = 1 LIMIT 1
---
  def update
    @locationset = Locationset.find(params[:id])