app/controllers/synths_controller.rb

  def index
    @synths = Synth.all
---
SELECT "synths".* FROM "synths"

  def show
    @synth = Synth.find(params[:id])
---
SELECT "synths".* FROM "synths" WHERE "synths"."id" = 1 LIMIT 1

  def edit
    @synth = Synth.find(params[:id])
---
SELECT "synths".* FROM "synths" WHERE "synths"."id" = 1 LIMIT 1

  def create
    @synth = Synth.new(params[:synth])

    respond_to do |format|
      if @synth.save
---
INSERT INTO "synths" ("name", "url", "parameters", "location_id", "created_at", "updated_at") VALUES ('magic', 'stuff.org/morestuff', '42', 0, '2011-07-01 15:39:56.266285', '2011-07-01 15:39:56.266285')

  def update
    @synth = Synth.find(params[:id])

    respond_to do |format|
      if @synth.update_attributes(params[:synth])
---
SELECT "synths".* FROM "synths" WHERE "synths"."id" = 1 LIMIT 1
UPDATE "synths" SET "url" = 'stuff.org/stuff', "updated_at" = '2011-07-05 17:48:18.949823' WHERE "synths"."id" = 2