app/controllers/synthinstances_controller.rb

  def index
    @synthinstances = Synthinstance.all
---
SELECT "synthinstances".* FROM "synthinstances"

  def show
    @synthinstance = Synthinstance.find(params[:id])
---
SELECT "synthinstances".* FROM "synthinstances" WHERE "synthinstances"."id" = 1 LIMIT 1

  def create
    @synthinstance = Synthinstance.new(params[:synthinstance])

    respond_to do |format|
      if @synthinstance.save
---
INSERT INTO "synthinstances" ("params", "created_at", "updated_at") VALUES ('stuff', '2011-07-01 17:24:49.796416', '2011-07-01 17:24:49.796416')