app/controllers/userparams_controller.rb

SELECT "userparams".* FROM "userparams"
---
  def index
    @userparams = Userparam.all

SELECT "userparams".* FROM "userparams" WHERE "userparams"."id" = 1 LIMIT 1
---
  def show
    @userparam = Userparam.find(params[:id])

SELECT "userparams".* FROM "userparams" WHERE "userparams"."id" = 2 LIMIT 1
---
  def edit
    @userparam = Userparam.find(params[:id])

INSERT INTO "userparams" ("value", "created_at", "updated_at", "name", "param_id", "synth_id", "user_id") VALUES (0.5, '2011-07-14 22:32:27.545770', '2011-07-14 22:32:27.545770', 'param_1', 1, 1, 1)
---
  def create
    @userparam = Userparam.new(params[:userparam])

    respond_to do |format|
      if @userparam.save