app/controllers/users_controller.rb

INSERT INTO "users" ("name", "ip", "active", "synth_id", "audio_id", "location_id", "created_at", "updated_at", "latitude", "longitude") VALUES ('Red Leader', 'stuff.com', 'f', NULL, NULL, NULL, '2011-07-01 18:24:03.178933', '2011-07-01 18:24:03.178933', NULL, NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

INSERT INTO "users" ("name", "ip", "active", "synth_id", "audio_id", "location_id", "created_at", "updated_at", "latitude", "longitude", "password") VALUES ('Red Loser', '173.253.154.222', 't', NULL, NULL, NULL, '2011-07-14 01:27:59.019891', '2011-07-14 01:27:59.019891', 30.4116339, -91.18201730000001, 'stuff')
INSERT INTO "userparams" ("created_at", "updated_at", "user_id", "value_1", "value_2", "value_3") VALUES ('2011-07-17 04:03:25.504908', '2011-07-17 04:03:25.504908', 7, NULL, NULL, NULL)
---
  def device_create
    @user = User.new(params[:user])
    data = {"active" => true, "name" => params[:name], "password" => params[:password], "latitude" => params[:latitude], "longitude" => params[:longitude], "synth_id" => 1, "audio_id" => 1, "ip" => request.remote_ip, "synth_id" => 1, "audio_id" => 1}
    @user.update_attributes(data)
    respond_to do |format|
      if @user.save
        #create a userparam for this
        #@userparam = Userparam.new_by_user_id(@user.id)
        @userparam = Userparam.new
        @userparam.user_id = @user.id
        @userparam.save

SELECT 1 FROM "users" WHERE ("users"."name" = 'Red Leader') AND ("users".id <> 1) LIMIT 1
UPDATE "users" SET "active" = 't', "ip" = '173.253.145.144', "updated_at" = '2011-07-14 07:38:55.480520' WHERE "users"."id" = 1
---
  def device_login
    #check if the username and password match. return the id if yes. 0 if no.
    #set that @user as active
    @user = User.find_by_name(params[:name])
    response = ""
    unless @user.nil?
      if @user.password == params[:password]
        data = {"active" => true, "ip" => request.remote_ip}
        @user.update_attributes(data)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "active" = 'f', "ip" = '173.253.154.222', "updated_at" = '2011-07-14 01:58:54.801617' WHERE "users"."id" = 1
---
  def device_logout
    @user = User.find(params[:id])
    data = {"active" => false, "ip" => request.remote_ip}
    @user.update_attributes(data)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'Red Lead', "updated_at" = '2011-07-14 00:44:35.542928' WHERE "users"."id" = 1
---
  def device_edit
    @user = User.find(params[:id])
    data = {"name" => params[:name], "password" => params[:password], "ip" => request.remote_ip}

    respond_to do |format|
      if @user.update_attributes(data)

SELECT "userparams".* FROM "userparams" WHERE "userparams"."user_id" = 1 LIMIT 1
UPDATE "userparams" SET "value_1" = 0.754, "value_2" = 0.93, "value_3" = 0.306, "updated_at" = '2011-07-15 05:46:41.946348' WHERE "userparams"."id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def device_update_params
    @param = Userparam.find_by_user_id(params[:id])
    @param.value_1 = params[:param_1]
    @param.value_2 = params[:param_2]
    @param.value_3 = params[:param_3]
    @param.save
    Location.aggregate_params(User.find(params[:id]))

SELECT 1 FROM "locations" WHERE ("locations"."name" = 'Johnston') AND ("locations".id <> 2) LIMIT 1
UPDATE "locations" SET "param_1" = 0.319, "param_2" = 0.0, "param_3" = -Infinity, "updated_at" = '2011-07-17 02:40:20.714564' WHERE "locations"."id" = 3
---
  def device_enter_location
    @location = Location.find_by_name(params[:location_name])

    @location.user_ids = @location.user_ids + [params[:id]]
    logger.debug("ids = #{@location.user_ids.inspect}")
    @location.save

SELECT 1 FROM "locations" WHERE ("locations"."name" = 'Johnston') AND ("locations".id <> 2) LIMIT 1
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 2 LIMIT 1
SELECT "users".id FROM "users" INNER JOIN "locations_users" ON "users".id = "locations_users".user_id WHERE ("locations_users".location_id = 2 )
---
  def device_exit_location
    @location = Location.find_by_name(params[:location_name])
    @location.users.delete(User.find(params[:id]))

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "active" = 't', "synth_id" = 1, "audio_id" = 1, "location_id" = 1, "updated_at" = '2011-07-01 18:24:10.937269' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "latitude" = 30.41220038, "longitude" = -91.18165328, "ip" = '173.253.201.148', "updated_at" = '2011-07-22 15:00:38.567443' WHERE "users"."id" = 2
---
  def update_2
    @user = User.find(params[:id])
    data = {"latitude" => params[:latitude], "longitude" => params[:longitude], "ip" => request.remote_ip}

    respond_to do |format|
      if @user.update_attributes(data)