app/views/locations/_form.html.erb

SELECT "groups".* FROM "groups"
---
    <%= f.label :group_ids %><br />
    <%= f.collection_select :group_ids, Group.all, :id, :name, {}, { :multiple => true, :selected => 'location[group_ids]', :name => 'location[group_ids][]' } %>

SELECT "locationsets".* FROM "locationsets"
---
    <%= f.label :locationset_ids %><br />
    <%= f.collection_select :locationset_ids, Locationset.all, :id, :name, {}, { :multiple => true, :selected => 'location[locationset_ids]', :name => 'location[locationset_ids][]' } %>